Revit 2026 API

# PipeFittingAndAccessoryPressureDropData Methods

---

The PipeFittingAndAccessoryPressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPipeFittingAndAccessoryData | Returns the fitting and accessory information |
|  | GetPresureDropItems | Returns the pressure drop items |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDefaultEntity | Stores the default entity in the data. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PipeFittingAndAccessoryPressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace